---
type: Instance
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# Instance

`Autodesk.Revit.DB.Instance` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetTotalTransform | 2012 | `public Transform GetTotalTransform ()` |
| Method | GetTransform | 2012 | `public Transform GetTransform ()` |
| Property | Parameter | — | `` |